# Preparing Mexico Data

In [3]:
import pandas as pd

# Import

The first step of any data science project is preparing data that is importing your raw data and cleaning it.

**Task 1.2.1:** Read these three files into three separate DataFrames named `df1`, `df2`, and `df3`, respectively.

In [4]:
# Load CSV files into DataFrames
df1 = pd.read_csv("data/mexico-real-estate-1.csv")
df2 = pd.read_csv("data/mexico-real-estate-2.csv")
df3 = pd.read_csv("data/mexico-real-estate-3.csv")

# Print object type and shape for DataFrames
print("df1 type:", type(df1))
print("df1 shape:", df1.shape)
print()
print("df2 type:", type(df2))
print("df2 shape:", df2.shape)
print()
print("df3 type:", type(df3))
print("df3 shape:", df3.shape)

df1 type: <class 'pandas.core.frame.DataFrame'>
df1 shape: (1000, 6)

df2 type: <class 'pandas.core.frame.DataFrame'>
df2 shape: (1000, 6)

df3 type: <class 'pandas.core.frame.DataFrame'>
df3 shape: (1000, 5)

## Clean `df1`

**Task 1.2.2:** Inspect `df1` by looking at its [`shape`] attribute. Then use the [`info`] method to see the data types and number of missing values for each column. Finally, use the [`head`] method to determine to look at the first five rows of your dataset.

In [7]:
# Print df1 shape
df1.shape

# Print df1 info
df1.info()
print()

# Get output of df1 head
df1.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  1000 non-null   object
 1   state          177 non-null    object
 2   lat            942 non-null    float64
 3   lon            949 non-null    float64
 4   area_m2        1000 non-null   float64
 5   price_usd      1000 non-null   object
dtypes: float64(3), object(3)
memory usage: 47.0+ KB

  property_type    state        lat         lon  area_m2   price_usd
0         house      NaN  40.914125   20.742721    172.2  $115930.83
1     apartment      NaN        NaN  -47.299722    135.4  $218046.93
2     apartment      NaN  24.479833         NaN    365.6   $80921.09
3         house      NaN  10.171884  106.464146     80.6   $78924.33
4     apartment  Setúbal  38.538533         NaN    176.1   $59591.87

It looks like there are a couple of problems in this DataFrame that you need to solve. First, there are many rows with `NaN` values in the `"lat"` and `"lon"` columns. Second, the data type for the `"price_usd"` column is `object` when it should be `float`.

**Task 1.2.3:** Clean `df1` by dropping rows with `NaN` values. Then remove the `"$"` and `","` characters from `"price_usd"` and recast the values in the column as floats.